In [1]:
import pandas as pd
import pathlib

In [2]:
#地址
cwd = pathlib.Path.cwd()
path_data=cwd/'平均气温'
path_data
path_result=pathlib.Path(path_data/'result/')
path_result.mkdir(parents=True, exist_ok=True)

WindowsPath('E:/GitHub/平均气温/平均气温')

In [3]:
#read data
df=pd.concat([pd.read_csv(path1,encoding = 'GB2312',sep='\s+')
                   for path1 in path_data.rglob('t*')])
df.columns=['site','year','mon','day','var']

#站号
#df=df[df['site']!=57646]
#df=df[df['site']==57646]
df.head()

    site  year  mon  day  var
0  57544  1959    3    1   66
1  57544  1959    3    2   69
2  57544  1959    3    3   88
3  57544  1959    3    4  114
4  57544  1959    3    5  153

In [4]:
#set time index and choose date
df['DateTime'] = pd.to_datetime(
        pd.to_datetime(
            df['year']*10000+df['mon']*100+df['day'],
            format='%Y%m%d'))
df['M&D'] = pd.to_datetime(
        pd.to_datetime(
            2000*10000+df['mon']*100+df['day'],
            format='%Y%m%d'))
#df=df.drop_duplicates()
df=df.set_index('M&D')
df=df.loc['2000 03 13': '2000 06 25',:]
df=df.set_index('DateTime')
df.head()
df.shape

             site  year  mon  day  var
DateTime
1959-03-13  57544  1959    3   13   58
1959-03-14  57544  1959    3   14   55
1959-03-15  57544  1959    3   15   59
1959-03-16  57544  1959    3   16   87
1959-03-17  57544  1959    3   17  102

(615708, 5)

In [5]:
def Q1_1(df1):
#    print(df1)
    count=df1['var'].value_counts(ascending=True)
    
    if (count.index.max()==32766):
        if count[32766]>len(df1)*0.2:
            print(df1['year'][0],df1['site'][0])
        else :
            return df1
    else:
        return df1



df1=df.groupby(['site','year']).apply(Q1_1)
df1.index=df1.index.droplevel(level=[0,1])

1962 57666

In [11]:
q1=df1.groupby(['mon','day']).mean().drop(['site','year'],axis=1)
q1.reset_index().head()

   mon  day         var
0    3   13  116.886364
1    3   14  119.654306
2    3   15  118.351504
3    3   16  132.618421
4    3   17  118.850308

In [7]:
q2=df1.groupby(['site',]).mean().drop(['mon','year','day'],axis=1)
q2.head()

              var
site
57544  194.652222
57554  187.513193
57558  194.270046
57562  193.486844
57564  196.320430

In [8]:

idx=df1.replace({32766:-999}).groupby(['site',])['var'].transform(max) == df1['var']
q3=df1[idx]
q3['site1']=q3['site']
q3=q3.set_index('site1')
q3.head()

C:\Users\t\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

        site  year  mon  day  var
site1
57544  57544  2013    6   20  308
57554  57554  1981    6   21  317
57558  57558  2013    6   20  324
57562  57562  2013    6   19  329
57564  57564  2013    6   19  332

In [9]:
for indexs in q3.index: 
    df=pd.DataFrame(data=q3.loc[indexs])
    df.T.to_csv((path_result/(str(df.iloc[0,0])+'.txt')),index=None,sep=' ')

df

        site  year  mon  day  var
site1
59063  59063  2007    6   24  309
59063  59063  2009    6   21  309
59063  59063  2016    6    2  309